# GetCopiedMemberIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BaseArray..::..GetCopiedMemberIds Method
BaseArray Class See Also
---
Retrieves the copied member Ids of the Array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public abstract ICollection<ElementId> GetCopiedMemberIds()
```

Visual Basic
---
```text
Public MustOverride Function GetCopiedMemberIds As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
virtual ICollection<ElementId^>^ GetCopiedMemberIds() abstract
```

# ### Return Value
The copied member Ids of the Array
# See Also
BaseArray Class
Autodesk.Revit.DB Namespace